<?xml version="1.0" ?>
<net name="birdmodel" version="11">
	<layers>
		<layer id="0" name="conv1d_4_input" type="Parameter" version="opset1">
			<data element_type="f32" shape="1,20,128"/>
			<rt_info>
				<attribute name="fused_names" value="conv1d_4_input" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="Func/StatefulPartitionedCall/input/_1:0,conv1d_4_input,conv1d_4_input:0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="StatefulPartitionedCall/model/conv1d_4/conv1d/ExpandDims/dim" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/conv1d_4/conv1d/ExpandDims/dim" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/conv1d_4/conv1d/ExpandDims/dim:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="StatefulPartitionedCall/model/conv1d_4/conv1d/ExpandDims" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/conv1d_4/conv1d/ExpandDims" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>20</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="StatefulPartitionedCall/model/conv1d_4/conv1d/ExpandDims/Transpose/value11782176" type="Const" version="opset1">
			<data element_type="i64" offset="8" shape="4" size="32"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/conv1d_4/conv1d/ExpandDims/Transpose/value11782176" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="StatefulPartitionedCall/model/conv1d_4/conv1d/ExpandDims/Transpose" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/conv1d_4/conv1d/ExpandDims/Transpose" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>20</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/conv1d_4/conv1d/ExpandDims:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="StatefulPartitionedCall/model/conv1d_4/conv1d/ExpandDims_1" type="Const" version="opset1">
			<data element_type="f32" offset="40" shape="128, 128, 1, 3" size="196608"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/conv1d_4/conv1d/ExpandDims_1" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/conv1d_4/conv1d/ExpandDims_1:0" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="StatefulPartitionedCall/model/conv1d_4/conv1d" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/conv1d_4/conv1d" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_809" type="Const" version="opset1">
			<data element_type="i64" offset="196648" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/conv1d_4/conv1d/Squeeze, StatefulPartitionedCall/model/conv1d_4/conv1d/Transpose" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Squeeze_810" type="Squeeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/conv1d_4/conv1d/Squeeze, StatefulPartitionedCall/model/conv1d_4/conv1d/Transpose" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>18</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_811" type="Const" version="opset1">
			<data element_type="i64" offset="196656" shape="3" size="24"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/conv1d_4/conv1d/Squeeze, StatefulPartitionedCall/model/conv1d_4/conv1d/Transpose" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="StatefulPartitionedCall/model/conv1d_4/conv1d/Squeeze" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/conv1d_4/conv1d/Squeeze, StatefulPartitionedCall/model/conv1d_4/conv1d/Transpose" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>18</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/conv1d_4/conv1d/Squeeze:0" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="StatefulPartitionedCall/model/conv1d_4/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="196680" shape="1, 1, 128" size="512"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/conv1d_4/BiasAdd/ReadVariableOp" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/conv1d_4/BiasAdd/ReadVariableOp:0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="StatefulPartitionedCall/model/conv1d_4/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/conv1d_4/BiasAdd/Add" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/conv1d_4/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="StatefulPartitionedCall/model/conv1d_4/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/conv1d_4/Relu" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/model/conv1d_4/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="StatefulPartitionedCall/model/max_pooling1d_4/ExpandDims/dim" type="Const" version="opset1">
			<data element_type="i64" offset="196648" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/max_pooling1d_4/ExpandDims/dim" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/max_pooling1d_4/ExpandDims/dim:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="StatefulPartitionedCall/model/max_pooling1d_4/ExpandDims" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/max_pooling1d_4/ExpandDims" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="StatefulPartitionedCall/model/max_pooling1d_4/ExpandDims/Transpose/value11822125" type="Const" version="opset1">
			<data element_type="i64" offset="8" shape="4" size="32"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/max_pooling1d_4/ExpandDims/Transpose/value11822125" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="StatefulPartitionedCall/model/max_pooling1d_4/ExpandDims/Transpose" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/max_pooling1d_4/ExpandDims/Transpose" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/max_pooling1d_4/ExpandDims:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>18</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="StatefulPartitionedCall/model/max_pooling1d_4/MaxPool" type="MaxPool" version="opset8">
			<data auto_pad="valid" axis="0" dilations="1, 1" index_element_type="i64" kernel="2, 1" pads_begin="0, 0" pads_end="0, 0" rounding_type="floor" strides="2, 1"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/max_pooling1d_4/MaxPool" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>18</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Constant_816" type="Const" version="opset1">
			<data element_type="i64" offset="197192" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/max_pooling1d_4/MaxPool/Transpose, StatefulPartitionedCall/model/max_pooling1d_4/Squeeze" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Squeeze_817" type="Squeeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/max_pooling1d_4/MaxPool/Transpose, StatefulPartitionedCall/model/max_pooling1d_4/Squeeze" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Constant_818" type="Const" version="opset1">
			<data element_type="i64" offset="196656" shape="3" size="24"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/max_pooling1d_4/MaxPool/Transpose, StatefulPartitionedCall/model/max_pooling1d_4/Squeeze" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="StatefulPartitionedCall/model/max_pooling1d_4/Squeeze" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/max_pooling1d_4/MaxPool/Transpose, StatefulPartitionedCall/model/max_pooling1d_4/Squeeze" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/max_pooling1d_4/Squeeze:0" precision="FP32">
					<dim>1</dim>
					<dim>9</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="StatefulPartitionedCall/model/conv1d_5/conv1d/ExpandDims/dim" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/conv1d_5/conv1d/ExpandDims/dim" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/conv1d_5/conv1d/ExpandDims/dim:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="StatefulPartitionedCall/model/conv1d_5/conv1d/ExpandDims" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/conv1d_5/conv1d/ExpandDims" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>9</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>9</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="StatefulPartitionedCall/model/conv1d_5/conv1d/ExpandDims/Transpose/value11862098" type="Const" version="opset1">
			<data element_type="i64" offset="8" shape="4" size="32"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/conv1d_5/conv1d/ExpandDims/Transpose/value11862098" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="StatefulPartitionedCall/model/conv1d_5/conv1d/ExpandDims/Transpose" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/conv1d_5/conv1d/ExpandDims/Transpose" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>9</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/conv1d_5/conv1d/ExpandDims:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="StatefulPartitionedCall/model/conv1d_5/conv1d/ExpandDims_1" type="Const" version="opset1">
			<data element_type="f32" offset="197200" shape="32, 128, 1, 3" size="49152"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/conv1d_5/conv1d/ExpandDims_1" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/conv1d_5/conv1d/ExpandDims_1:0" precision="FP32">
					<dim>32</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="StatefulPartitionedCall/model/conv1d_5/conv1d" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/conv1d_5/conv1d" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>9</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_823" type="Const" version="opset1">
			<data element_type="i64" offset="196648" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/conv1d_5/conv1d/Squeeze, StatefulPartitionedCall/model/conv1d_5/conv1d/Transpose" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Squeeze_824" type="Squeeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/conv1d_5/conv1d/Squeeze, StatefulPartitionedCall/model/conv1d_5/conv1d/Transpose" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Constant_825" type="Const" version="opset1">
			<data element_type="i64" offset="196656" shape="3" size="24"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/conv1d_5/conv1d/Squeeze, StatefulPartitionedCall/model/conv1d_5/conv1d/Transpose" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="StatefulPartitionedCall/model/conv1d_5/conv1d/Squeeze" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/conv1d_5/conv1d/Squeeze, StatefulPartitionedCall/model/conv1d_5/conv1d/Transpose" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/conv1d_5/conv1d/Squeeze:0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="StatefulPartitionedCall/model/conv1d_5/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="246352" shape="1, 1, 32" size="128"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/conv1d_5/BiasAdd/ReadVariableOp" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/conv1d_5/BiasAdd/ReadVariableOp:0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="StatefulPartitionedCall/model/conv1d_5/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/conv1d_5/BiasAdd/Add" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/conv1d_5/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="StatefulPartitionedCall/model/conv1d_5/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/conv1d_5/Relu" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/model/conv1d_5/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="StatefulPartitionedCall/model/max_pooling1d_5/ExpandDims/dim" type="Const" version="opset1">
			<data element_type="i64" offset="196648" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/max_pooling1d_5/ExpandDims/dim" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/max_pooling1d_5/ExpandDims/dim:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="StatefulPartitionedCall/model/max_pooling1d_5/ExpandDims" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/max_pooling1d_5/ExpandDims" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="StatefulPartitionedCall/model/max_pooling1d_5/ExpandDims/Transpose/value11902143" type="Const" version="opset1">
			<data element_type="i64" offset="8" shape="4" size="32"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/max_pooling1d_5/ExpandDims/Transpose/value11902143" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="StatefulPartitionedCall/model/max_pooling1d_5/ExpandDims/Transpose" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/max_pooling1d_5/ExpandDims/Transpose" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/max_pooling1d_5/ExpandDims:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>7</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="StatefulPartitionedCall/model/max_pooling1d_5/MaxPool" type="MaxPool" version="opset8">
			<data auto_pad="valid" axis="0" dilations="1, 1" index_element_type="i64" kernel="2, 1" pads_begin="0, 0" pads_end="0, 0" rounding_type="floor" strides="2, 1"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/max_pooling1d_5/MaxPool" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>7</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Constant_830" type="Const" version="opset1">
			<data element_type="i64" offset="197192" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/max_pooling1d_5/MaxPool/Transpose, StatefulPartitionedCall/model/max_pooling1d_5/Squeeze" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Squeeze_831" type="Squeeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/max_pooling1d_5/MaxPool/Transpose, StatefulPartitionedCall/model/max_pooling1d_5/Squeeze" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Constant_832" type="Const" version="opset1">
			<data element_type="i64" offset="196656" shape="3" size="24"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/max_pooling1d_5/MaxPool/Transpose, StatefulPartitionedCall/model/max_pooling1d_5/Squeeze" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="StatefulPartitionedCall/model/max_pooling1d_5/Squeeze" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/max_pooling1d_5/MaxPool/Transpose, StatefulPartitionedCall/model/max_pooling1d_5/Squeeze" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/max_pooling1d_5/Squeeze:0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="StatefulPartitionedCall/model/flatten_2/Reshape/shape104" type="Const" version="opset1">
			<data element_type="i64" offset="246480" shape="2" size="16"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/flatten_2/Reshape/shape104" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="StatefulPartitionedCall/model/flatten_2/Reshape" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/flatten_2/Reshape" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/flatten_2/Reshape:0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="StatefulPartitionedCall/model/dense_10/MatMul/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="246496" shape="64, 96" size="24576"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/dense_10/MatMul/ReadVariableOp" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/dense_10/MatMul/ReadVariableOp:0" precision="FP32">
					<dim>64</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="StatefulPartitionedCall/model/dense_10/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/dense_10/MatMul" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/dense_10/MatMul:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="StatefulPartitionedCall/model/dense_10/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="271072" shape="1, 64" size="256"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/dense_10/BiasAdd/ReadVariableOp" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/dense_10/BiasAdd/ReadVariableOp:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="StatefulPartitionedCall/model/dense_10/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/dense_10/BiasAdd/Add" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/dense_10/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="StatefulPartitionedCall/model/dense_10/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/dense_10/Relu" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/model/dense_10/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="StatefulPartitionedCall/model/dense_11/MatMul/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="271328" shape="128, 64" size="32768"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/dense_11/MatMul/ReadVariableOp" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/dense_11/MatMul/ReadVariableOp:0" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="StatefulPartitionedCall/model/dense_11/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/dense_11/MatMul" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/dense_11/MatMul:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="StatefulPartitionedCall/model/dense_11/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="304096" shape="1, 128" size="512"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/dense_11/BiasAdd/ReadVariableOp" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/dense_11/BiasAdd/ReadVariableOp:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="StatefulPartitionedCall/model/dense_11/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/dense_11/BiasAdd/Add" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/dense_11/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="StatefulPartitionedCall/model/dense_11/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/dense_11/Relu" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/model/dense_11/Relu:0,StatefulPartitionedCall/model/dropout_2/Identity:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="StatefulPartitionedCall/model/dense_12/MatMul/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="304608" shape="32, 128" size="16384"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/dense_12/MatMul/ReadVariableOp" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/dense_12/MatMul/ReadVariableOp:0" precision="FP32">
					<dim>32</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="StatefulPartitionedCall/model/dense_12/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/dense_12/MatMul" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/dense_12/MatMul:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="StatefulPartitionedCall/model/dense_12/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="320992" shape="1, 32" size="128"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/dense_12/BiasAdd/ReadVariableOp" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/dense_12/BiasAdd/ReadVariableOp:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="StatefulPartitionedCall/model/dense_12/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/dense_12/BiasAdd/Add" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/dense_12/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="StatefulPartitionedCall/model/dense_12/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/dense_12/Relu" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/model/dense_12/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="StatefulPartitionedCall/model/dense_13/MatMul/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="321120" shape="64, 32" size="8192"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/dense_13/MatMul/ReadVariableOp" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/dense_13/MatMul/ReadVariableOp:0" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="StatefulPartitionedCall/model/dense_13/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/dense_13/MatMul" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/dense_13/MatMul:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="StatefulPartitionedCall/model/dense_13/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="329312" shape="1, 64" size="256"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/dense_13/BiasAdd/ReadVariableOp" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/dense_13/BiasAdd/ReadVariableOp:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="StatefulPartitionedCall/model/dense_13/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/dense_13/BiasAdd/Add" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/dense_13/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="StatefulPartitionedCall/model/dense_13/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/dense_13/Relu" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/model/dense_13/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="StatefulPartitionedCall/model/dense_14/MatMul/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="329568" shape="7, 64" size="1792"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/dense_14/MatMul/ReadVariableOp" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/dense_14/MatMul/ReadVariableOp:0" precision="FP32">
					<dim>7</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="StatefulPartitionedCall/model/dense_14/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/dense_14/MatMul" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>7</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/dense_14/MatMul:0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="StatefulPartitionedCall/model/dense_14/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="331360" shape="1, 7" size="28"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/dense_14/BiasAdd/ReadVariableOp" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/dense_14/BiasAdd/ReadVariableOp:0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="StatefulPartitionedCall/model/dense_14/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/dense_14/BiasAdd/Add" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/dense_14/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="StatefulPartitionedCall/model/dense_14/Softmax" type="SoftMax" version="opset8">
			<data axis="1"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/model/dense_14/Softmax" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" names="Func/StatefulPartitionedCall/output/_16:0,Identity:0,StatefulPartitionedCall/Identity:0,StatefulPartitionedCall/model/dense_14/Softmax:0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Func/StatefulPartitionedCall/output/_16:0" type="Result" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="Func/StatefulPartitionedCall/output/_16:0" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="2" to-port="0"/>
		<edge from-layer="1" from-port="0" to-layer="2" to-port="1"/>
		<edge from-layer="2" from-port="2" to-layer="4" to-port="0"/>
		<edge from-layer="3" from-port="0" to-layer="4" to-port="1"/>
		<edge from-layer="4" from-port="2" to-layer="6" to-port="0"/>
		<edge from-layer="5" from-port="0" to-layer="6" to-port="1"/>
		<edge from-layer="6" from-port="2" to-layer="8" to-port="0"/>
		<edge from-layer="7" from-port="0" to-layer="8" to-port="1"/>
		<edge from-layer="8" from-port="2" to-layer="10" to-port="0"/>
		<edge from-layer="9" from-port="0" to-layer="10" to-port="1"/>
		<edge from-layer="10" from-port="2" to-layer="12" to-port="0"/>
		<edge from-layer="11" from-port="0" to-layer="12" to-port="1"/>
		<edge from-layer="12" from-port="2" to-layer="13" to-port="0"/>
		<edge from-layer="13" from-port="1" to-layer="15" to-port="0"/>
		<edge from-layer="14" from-port="0" to-layer="15" to-port="1"/>
		<edge from-layer="15" from-port="2" to-layer="17" to-port="0"/>
		<edge from-layer="16" from-port="0" to-layer="17" to-port="1"/>
		<edge from-layer="17" from-port="2" to-layer="18" to-port="0"/>
		<edge from-layer="18" from-port="1" to-layer="20" to-port="0"/>
		<edge from-layer="19" from-port="0" to-layer="20" to-port="1"/>
		<edge from-layer="20" from-port="2" to-layer="22" to-port="0"/>
		<edge from-layer="21" from-port="0" to-layer="22" to-port="1"/>
		<edge from-layer="22" from-port="2" to-layer="24" to-port="0"/>
		<edge from-layer="23" from-port="0" to-layer="24" to-port="1"/>
		<edge from-layer="24" from-port="2" to-layer="26" to-port="0"/>
		<edge from-layer="25" from-port="0" to-layer="26" to-port="1"/>
		<edge from-layer="26" from-port="2" to-layer="28" to-port="0"/>
		<edge from-layer="27" from-port="0" to-layer="28" to-port="1"/>
		<edge from-layer="28" from-port="2" to-layer="30" to-port="0"/>
		<edge from-layer="29" from-port="0" to-layer="30" to-port="1"/>
		<edge from-layer="30" from-port="2" to-layer="32" to-port="0"/>
		<edge from-layer="31" from-port="0" to-layer="32" to-port="1"/>
		<edge from-layer="32" from-port="2" to-layer="34" to-port="0"/>
		<edge from-layer="33" from-port="0" to-layer="34" to-port="1"/>
		<edge from-layer="34" from-port="2" to-layer="35" to-port="0"/>
		<edge from-layer="35" from-port="1" to-layer="37" to-port="0"/>
		<edge from-layer="36" from-port="0" to-layer="37" to-port="1"/>
		<edge from-layer="37" from-port="2" to-layer="39" to-port="0"/>
		<edge from-layer="38" from-port="0" to-layer="39" to-port="1"/>
		<edge from-layer="39" from-port="2" to-layer="40" to-port="0"/>
		<edge from-layer="40" from-port="1" to-layer="42" to-port="0"/>
		<edge from-layer="41" from-port="0" to-layer="42" to-port="1"/>
		<edge from-layer="42" from-port="2" to-layer="44" to-port="0"/>
		<edge from-layer="43" from-port="0" to-layer="44" to-port="1"/>
		<edge from-layer="44" from-port="2" to-layer="46" to-port="0"/>
		<edge from-layer="45" from-port="0" to-layer="46" to-port="1"/>
		<edge from-layer="46" from-port="2" to-layer="48" to-port="0"/>
		<edge from-layer="47" from-port="0" to-layer="48" to-port="1"/>
		<edge from-layer="48" from-port="2" to-layer="50" to-port="0"/>
		<edge from-layer="49" from-port="0" to-layer="50" to-port="1"/>
		<edge from-layer="50" from-port="2" to-layer="51" to-port="0"/>
		<edge from-layer="51" from-port="1" to-layer="53" to-port="0"/>
		<edge from-layer="52" from-port="0" to-layer="53" to-port="1"/>
		<edge from-layer="53" from-port="2" to-layer="55" to-port="0"/>
		<edge from-layer="54" from-port="0" to-layer="55" to-port="1"/>
		<edge from-layer="55" from-port="2" to-layer="56" to-port="0"/>
		<edge from-layer="56" from-port="1" to-layer="58" to-port="0"/>
		<edge from-layer="57" from-port="0" to-layer="58" to-port="1"/>
		<edge from-layer="58" from-port="2" to-layer="60" to-port="0"/>
		<edge from-layer="59" from-port="0" to-layer="60" to-port="1"/>
		<edge from-layer="60" from-port="2" to-layer="61" to-port="0"/>
		<edge from-layer="61" from-port="1" to-layer="63" to-port="0"/>
		<edge from-layer="62" from-port="0" to-layer="63" to-port="1"/>
		<edge from-layer="63" from-port="2" to-layer="65" to-port="0"/>
		<edge from-layer="64" from-port="0" to-layer="65" to-port="1"/>
		<edge from-layer="65" from-port="2" to-layer="66" to-port="0"/>
		<edge from-layer="66" from-port="1" to-layer="68" to-port="0"/>
		<edge from-layer="67" from-port="0" to-layer="68" to-port="1"/>
		<edge from-layer="68" from-port="2" to-layer="70" to-port="0"/>
		<edge from-layer="69" from-port="0" to-layer="70" to-port="1"/>
		<edge from-layer="70" from-port="2" to-layer="71" to-port="0"/>
		<edge from-layer="71" from-port="1" to-layer="72" to-port="0"/>
	</edges>
	<meta_data>
		<MO_version value="2022.1.0-7019-cdb9bec7210-releases/2022/1"/>
		<Runtime_version value="2022.1.0-7019-cdb9bec7210-releases/2022/1"/>
		<legacy_path value="True"/>
		<cli_parameters>
			<caffe_parser_path value="DIR"/>
			<compress_fp16 value="False"/>
			<data_type value="float"/>
			<disable_nhwc_to_nchw value="False"/>
			<disable_omitting_optional value="False"/>
			<disable_resnet_optimization value="False"/>
			<disable_weights_compression value="False"/>
			<enable_concat_optimization value="False"/>
			<enable_flattening_nested_params value="False"/>
			<enable_ssd_gluoncv value="False"/>
			<extensions value="DIR"/>
			<framework value="tf"/>
			<freeze_placeholder_with_value value="{}"/>
			<input_model_is_text value="False"/>
			<input_shape value="[1,20,128]"/>
			<k value="DIR/CustomLayersMapping.xml"/>
			<layout value="()"/>
			<layout_values value="{}"/>
			<legacy_mxnet_model value="False"/>
			<log_level value="ERROR"/>
			<mean_scale_values value="{}"/>
			<mean_values value="()"/>
			<model_name value="birdmodel"/>
			<output_dir value="DIR"/>
			<packed_user_shapes value="defaultdict(&lt;class 'list'&gt;, {'conv1d_4_input': [{'shape': (1, 20, 128), 'port': None, 'added': True}]})"/>
			<placeholder_data_types value="{}"/>
			<placeholder_shapes value="(1, 20, 128)"/>
			<progress value="False"/>
			<remove_memory value="False"/>
			<remove_output_softmax value="False"/>
			<reverse_input_channels value="False"/>
			<save_params_from_nd value="False"/>
			<saved_model_dir value="DIR"/>
			<scale_values value="()"/>
			<silent value="False"/>
			<source_layout value="()"/>
			<static_shape value="False"/>
			<stream_output value="False"/>
			<target_layout value="()"/>
			<transform value=""/>
			<use_legacy_frontend value="False"/>
			<use_new_frontend value="False"/>
			<unset unset_cli_parameters="batch, counts, disable_fusing, finegrain_fusing, input, input_checkpoint, input_meta_graph, input_model, input_proto, input_symbol, mean_file, mean_file_offsets, nd_prefix_name, output, pretrained_model_name, saved_model_tags, scale, tensorboard_logdir, tensorflow_custom_layer_libraries, tensorflow_custom_operations_config_update, tensorflow_object_detection_api_pipeline_config, tensorflow_use_custom_operations_config, transformations_config"/>
		</cli_parameters>
	</meta_data>
</net>
